In [327]:
import pandas as pd

In [328]:
df = pd.DataFrame({'Name': ['Seyfullayev Idrak', "Susanova Susan", "Arifov Arif", "Aliyeva Elnara"], "Gender": ["", '', '', '']})

In [329]:
df

                Name Gender
0  Seyfullayev Idrak
1     Susanova Susan
2        Arifov Arif
3     Aliyeva Elnara

In [330]:
df.Name.str.split(' ').str.get(0)

0    Seyfullayev
1       Susanova
2         Arifov
3        Aliyeva
Name: Name, dtype: object

In [331]:
df.Name.str.split(' ', n=1, expand=True)

             0       1
0  Seyfullayev   Idrak
1     Susanova   Susan
2       Arifov    Arif
3      Aliyeva  Elnara

In [332]:
df['Name_']=df.Name.str.split(' ', n=1, expand=True)[1]

In [333]:
df['Surname'] = df.Name.str.split(' ', n=1, expand=True)[0]

In [334]:
df

                Name Gender   Name_      Surname
0  Seyfullayev Idrak          Idrak  Seyfullayev
1     Susanova Susan          Susan     Susanova
2        Arifov Arif           Arif       Arifov
3     Aliyeva Elnara         Elnara      Aliyeva

In [335]:
df.loc[df.Surname.str.endswith('a'), 'Gender'] = 'Female'

In [336]:
df[df.Surname.str.endswith('a')]['Gender'] = 'Female'

C:\Users\dell\AppData\Local\Temp\ipykernel_5704\3091257861.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[df.Surname.str.endswith('a')]['Gender'] = 'Female'

In [337]:
df

                Name  Gender   Name_      Surname
0  Seyfullayev Idrak           Idrak  Seyfullayev
1     Susanova Susan  Female   Susan     Susanova
2        Arifov Arif            Arif       Arifov
3     Aliyeva Elnara  Female  Elnara      Aliyeva

In [338]:
df.loc[~df.Surname.str.endswith('a'), 'Gender'] = 'Male'

In [339]:
df

                Name  Gender   Name_      Surname
0  Seyfullayev Idrak    Male   Idrak  Seyfullayev
1     Susanova Susan  Female   Susan     Susanova
2        Arifov Arif    Male    Arif       Arifov
3     Aliyeva Elnara  Female  Elnara      Aliyeva

In [356]:
import pandas as pd

In [357]:
df = pd.DataFrame({'Name': ['Seyfullayev Idrak', "Susanova Susan", "Arifov Arif", "Aliyeva Elnara"], "Gender": ["", '', '', '']})
df

                Name Gender
0  Seyfullayev Idrak
1     Susanova Susan
2        Arifov Arif
3     Aliyeva Elnara

In [358]:
df.Name.str.split(' ', n=1, expand=True)

             0       1
0  Seyfullayev   Idrak
1     Susanova   Susan
2       Arifov    Arif
3      Aliyeva  Elnara

In [359]:
df['Name_']=df.Name.str.split(' ', n=1, expand=True)[1]
df['Surname']=df.Name.str.split(' ', n=1, expand=True)[0]
df

                Name Gender   Name_      Surname
0  Seyfullayev Idrak          Idrak  Seyfullayev
1     Susanova Susan          Susan     Susanova
2        Arifov Arif           Arif       Arifov
3     Aliyeva Elnara         Elnara      Aliyeva

In [360]:
def add_gender(x):
    if x.Surname.endswith('a'):
        x.Gender = "Female"
    else:
        x.Gender = 'Male'
    return x

In [361]:
df.apply(add_gender, axis=1)

                Name  Gender   Name_      Surname
0  Seyfullayev Idrak    Male   Idrak  Seyfullayev
1     Susanova Susan  Female   Susan     Susanova
2        Arifov Arif    Male    Arif       Arifov
3     Aliyeva Elnara  Female  Elnara      Aliyeva